In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import yfinance as yf   
pd.options.display.float_format = '{:.4f}'.format
plt.style.use('seaborn-v0_8')

In [2]:
start_date = '2010-01-01'
end_date = '2020-12-31'
symbols = 'BA'

In [ ]:
df = yf.download(symbols, start=start_date, end=end_date, multi_level_index=False)

C:\Users\Mohit\AppData\Local\Temp\ipykernel_10772\1460194934.py:1: FutureWarning: YF.download() has changed argument auto_adjust default to True
  df = yf.download(symbols, start=start_date, end=end_date, multi_level_index=False)
[*********************100%***********************]  1 of 1 completed

In [4]:
df

              Close     High      Low     Open    Volume
Date
2010-01-04  43.7776  43.9412  42.7022  43.4191   6186700
2010-01-05  45.2114  45.4140  43.6373  43.8321   8867800
2010-01-06  46.5828  46.7464  45.1023  45.3750   8836500
2010-01-07  48.4686  48.5543  45.9906  46.3724  14379100
2010-01-08  48.0010  48.1413  47.4244  47.9543   7146600
...             ...      ...      ...      ...       ...
2020-12-23 219.6900 224.4000 219.3200 219.5500  10869000
2020-12-24 217.1500 219.8800 216.0500 219.6200   6398500
2020-12-28 216.0900 219.2000 215.1600 218.1900   9090600
2020-12-29 216.2500 221.6800 215.4000 218.3000  14593800
2020-12-30 216.6700 218.5500 214.3700 216.3600  10812600

[2768 rows x 5 columns]

In [20]:
BA = df.Close.dropna().to_frame().copy()

In [21]:
BA

              Close
Date
2010-01-04  43.7776
2010-01-05  45.2114
2010-01-06  46.5828
2010-01-07  48.4686
2010-01-08  48.0010
...             ...
2020-12-23 219.6900
2020-12-24 217.1500
2020-12-28 216.0900
2020-12-29 216.2500
2020-12-30 216.6700

[2768 rows x 1 columns]

In [23]:
BA.rename(columns={'Close':'Price'}, inplace=True)

In [26]:
BA.to_csv('boeing.csv')

In [27]:
boeing = pd.read_csv('boeing.csv', index_col='Date', parse_dates=[0])
boeing

              Price
Date
2010-01-04  43.7776
2010-01-05  45.2114
2010-01-06  46.5828
2010-01-07  48.4686
2010-01-08  48.0010
...             ...
2020-12-23 219.6900
2020-12-24 217.1500
2020-12-28 216.0900
2020-12-29 216.2500
2020-12-30 216.6700

[2768 rows x 1 columns]

In [31]:
boeing['Returns'] = boeing.Price.pct_change(periods=1)

In [32]:
boeing

              Price  Returns
Date
2010-01-04  43.7776      NaN
2010-01-05  45.2114   0.0328
2010-01-06  46.5828   0.0303
2010-01-07  48.4686   0.0405
2010-01-08  48.0010  -0.0096
...             ...      ...
2020-12-23 219.6900   0.0042
2020-12-24 217.1500  -0.0116
2020-12-28 216.0900  -0.0049
2020-12-29 216.2500   0.0007
2020-12-30 216.6700   0.0019

[2768 rows x 2 columns]

In [33]:
multiple = boeing.Price.iloc[-1] / boeing.Price.iloc[0]
multiple

np.float64(4.9493400283356)

In [34]:
( multiple - 1 ) * 100

np.float64(394.93400283356)

In [35]:
start = boeing.index[0]
end = boeing.index[-1]

td = (end - start).days
td

4013

In [36]:
td_years = td / 365.25  # Convert days to years

In [37]:
CAGR = (multiple ** (1/td_years)) - 1
CAGR * 100

np.float64(15.668578801451938)

In [39]:
n = boeing.Returns.count()
n

np.int64(2767)

In [40]:
gm = multiple ** (1/n) - 1
gm * 100

np.float64(0.05781411249992097)

In [41]:
investment_multiple_daily = (1 + boeing['Returns'].dropna()).prod()
investment_multiple_daily

np.float64(4.949340028335553)